<template>
    <article-page :html="contentHTML"></article-page>
</template>

<script>

import articlePage from '../../../../public/components/article.vue';
export default {
    components:{
        articlePage,
    },
    data () {
        return {
            contentHTML: `
                <h2>简介  <span>INTRODUCE</span></h2>
                <p>
                    2011年11月4日 崔振宽与西安市灞桥区人民政府、西安市纺织城综合发展办公室举行签约仪式<br>
                    2012年8月28日 崔振宽美术馆在西安灞桥生态湿地公园内举行奠基仪式<br>
                    2014年7月1日 崔振宽美术馆历经近2年的建设，建成封顶<br>
                    2015年7月 美术馆全体员工正式从筹备处搬入管内办公，筹备开馆活动与举办“苍山无言－崔拓宽画展”<br>
                    4月16日 西安崔振宽美术馆正式开馆<br>
                    <span style="display: inline-block;width: 48px;"></span>同时“苍山无言－崔拓宽画展”开幕<br>
                    <span style="display: inline-block;width: 48px;"></span>举办“从传统到今天－崔振宽的艺术追求”学术研讨会<br>
                    7月15日－7月22日 “风雅颂灞桥”书法美术摄影作品展<br>
                    8月14日——8月29日 意大利双个展《遥远的托斯卡纳－阿德里亚那·宾比/ 托斯卡纳 我的静夜－鲁道尔夫·柴考迪》<br>
                    8月14日 “国际性&amp;个性？当代&amp;过时？”意大利双个展学术研讨会<br>
                    8月23日 意大利双个展系列活动－“关于艺术，我们的下一代怎么办？”中意艺术创作、教学交流会<br>
                    8月24日 意大利双个展系列活动－邀请意大利艺术家赴西安美术学院参加“艺术种子的培育和成长”·教学交流活动<br>
                    9月10日 崔振宽山水画创作研修班开班<br>
                    9月25日－10月8日 “行进一带一路，对话中华文明”国际美术邀请展<br>
                    9月25日 “行进一带一路，对话中华文明”国际论坛<br>
                    10月15日 为高新一幼国际班中班举办艺术体验活动<br>
                    10月18日 为西安建筑科技大学艺术学院师生举办研学活动<br>
                    10月19日 为西安理工大学艺术学院师生举办研学活动<br>
                    10月21日 为未央区福田幼儿园的小朋友举办 “艺术点燃·大脑风暴”艺术体验活动<br>
                    10月21日 为西安铁一中滨河学校小学部三、四年级学生举办研学活动<br>
                    10月26日- 11月25日《2016 中国•西安 崔振宽美术馆国际雕塑创作展》<br>
                    10月26日 “望向远方和未来” 2016 中国•西安 崔振宽美术馆国际雕塑创作展学术交流会<br>
                    10月29日－11月6日 崔振宽山水画创作研修班赴汉中采风写生<br>
                    11月6日-11月20日《首届陕西省大学生摄影大展》<br>
                    11月6日 “有关当代摄影的一些话题”· 首届陕西省大学生摄影大展专题讲座<br>
                    11月20日-12月5日《墨色无间——汪劲松、王承云艺术实验展》<br>
                    11月20日“不只是个性——关于艺术合作计划”· 汪劲松、王承云艺术实验展学术研讨会
                </p>
            `,
        }
    },
}
</script>

<style lang="scss">
// @import "../../../../public/scss/basic.scss";
@import "../../../../public/scss/common.scss";

</style>
